{
  "unique_gaps": [],
  "unique_contradictions": [
    {
      "contradiction_id": "DIAL_001_CRITICAL",
      "medical_specialty": "nephrology",
      "contradiction_type": "session_frequency_medical_inconsistency",
      "clinical_severity": "CRITICAL",
      "description": "Policy allows haemodialysis (HD) at a 3 sessions/week standard while hemodiafiltration (HDF) is limited to 2 sessions/week for equivalent end-stage renal disease (ESRD) treatment.",
      "medical_analysis": {
        "clinical_rationale": "Both HD and HDF are renal replacement therapies intended to provide adequate solute and fluid removal. Adequacy is measured by weekly clearance (Kt/V or urea reduction ratio). For chronic dialysis patients, guideline-based practice requires equivalent frequency and dose irrespective of modality to achieve comparable clearance.",
        "medical_standards": "KDOQI (and other international renal guidelines) recommend a minimum of thrice-weekly dialysis (Kt/V ≥ 1.2 per session or equivalent weekly dialysis dose) for most patients on maintenance haemodialysis. There is no standard clinical justification to reduce HDF frequency compared with HD.",
        "clinical_equivalence": "HDF and HD serve the same end goal (clearance and fluid balance). Restricting frequency by modality creates an artificial barrier to adequate therapy.",
        "contraindication_assessment": "No valid patient-safety clinical reason for a lower session cap for HDF; many patients benefit from HDF (intra-dialytic haemodynamic stability, convection) and require >=3 sessions/week."
      },
      "patient_safety_impact": {
        "immediate_risk": "Patients prescribed HDF under the restricted schedule risk chronic under-dialysis.",
        "clinical_consequences": "Uremia, fluid overload, hyperkalemia, metabolic derangements, increased hospitalisations for cardiovascular complications and infections.",
        "survival_impact": "Chronic under-dialysis frequency is associated with higher morbidity and mortality.",
        "quality_of_life": "Worsened symptoms (fatigue, nausea, cognitive impairment) and increased health-care utilization."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Level 4-6 dialysis centres (the main providers) may be forced to choose modality-based rationing rather than patient-centered prescriptions.",
        "geographic_access": "Rural patients (70% of population) have limited facility options and cannot safely switch modalities to meet frequency limits.",
        "resource_allocation": "Inefficient use of advanced HDF-capable machines if policy artificially restricts their use.",
        "provider_training": "Confusion among nephrology and dialysis teams across 47 counties; risk of informal local workarounds."
      },
      "epidemiological_context": {
        "disease_burden": "CKD prevalence rising with hypertension (24% adult prevalence) and other risk factors.",
        "population_impact": "Large adult population (56.4 million) with CKD burden concentrated in rural areas will be disproportionately affected.",
        "health_system_capacity": "Limited number of Level 4-6 facilities capable of dialysis increases the practical harm of frequency restrictions."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Renal Care Package entries = 7",
          "Access points indicate services primarily available at Level 4-6"
        ],
        "policy_text_hd": "Maximum of 3 sessions per week for haemodialysis (documented in policy annexes)",
        "policy_text_hdf": "Maximum of 2 sessions per week for hemodiafiltration (documented in policy annexes)",
        "clinical_guidelines": "KDOQI 2015/2020 dialysis adequacy guidelines; international best practice"
      },
      "recommended_resolution": {
        "immediate_action": "Issue urgent interim directive permitting up to 3 sessions/week for HDF where clinically indicated and funded.",
        "policy_revision": "Amend benefit package to remove modality-based frequency limits and align dialysis frequency with clinical indications and KDOQI targets.",
        "implementation_steps": [
          "Notify all Level 4-6 dialysis providers and county health directors of interim directive within 72 hours.",
          "Update SHIF benefit documents and provider manuals to standardize dialysis frequency guidance across modalities.",
          "Deliver targeted training and clinical decision aids for nephrologists, dialysis nurses, and procurement officers across 47 counties."
        ],
        "timeline": "Immediate (interim directive within 72 hours); formal policy update within 4–8 weeks."
      },
      "quality_metrics": {
        "detection_confidence": 0.98,
        "clinical_impact_score": 9.6,
        "urgency_level": "CRITICAL_IMMEDIATE_ACTION",
        "validation_method": "Cross-reference with KDOQI and extracted policy entries showing modality-specific limits"
      },
      "pdf_page_sources": [
        "Pages 19-54 (Annex Procedures)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.319757",
      "run_number": 1,
      "unique_id": "CONTR_001"
    },
    {
      "contradiction_id": "EMERG_002_CRITICAL",
      "medical_specialty": "emergency_medicine / critical_care",
      "contradiction_type": "emergency_response_access_conflict",
      "clinical_severity": "CRITICAL",
      "description": "Critical illness and emergency services are inconsistently allocated across facility levels: many critical services are restricted to Level 4–6 while other packages allow Level 2–3 access, without defined emergency response times, triage or transfer mandates.",
      "medical_analysis": {
        "clinical_rationale": "Timely access to emergency and critical care (stabilisation, resuscitation, timely transfer) is lifesaving. Policy must define which facilities must provide immediate stabilization, which procedures require referral, and guaranteed transfer timelines.",
        "medical_standards": "WHO Emergency Care Systems Framework and national emergency medicine best practice require defined capabilities per facility level, clear triage, 24/7 emergency capability at designated levels, and protocols for stabilization and transfer.",
        "treatment_equivalence": "Allowing some critical procedures at lower levels without specifying stabilization/transfer capacity creates inconsistent care pathways.",
        "contraindication_assessment": "There is no clinical justification for lacking minimum emergency capability or transfer obligations at lower-level facilities that serve large rural populations."
      },
      "patient_safety_impact": {
        "immediate_risk": "Delayed resuscitation, inappropriate admission to facilities without critical care capability, preventable deaths from time-sensitive conditions (stroke, myocardial infarction, severe sepsis, trauma, obstetric hemorrhage).",
        "clinical_consequences": "Increased mortality and morbidity due to delayed definitive care and suboptimal stabilization.",
        "survival_impact": "Failure to specify emergency response leads to measurable increases in pre-transfer mortality and complications.",
        "quality_of_life": "Survivors may have worse functional outcomes due to delayed interventions."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Conflicting access points in dataset (Level 2-3 vs Level 4-6 vs Level 2-6) create county-level variability and risk of under-resourced facilities being expected to provide critical care.",
        "geographic_access": "Rural communities (70% population) dependent on Level 2–3 facilities may be unable to access timely critical interventions.",
        "resource_allocation": "Unclear obligations lead to poor planning for ambulance services, ICU beds, oxygen/ventilator supply, and staff training.",
        "provider_training": "Emergency clinicians face confusion about scope of practice and transfer expectations across counties."
      },
      "epidemiological_context": {
        "disease_burden": "CVD constitutes 25% of admissions and 13% of deaths — many require time-sensitive emergency interventions.",
        "population_impact": "High rural population without clear emergency access will see disproportionate adverse outcomes.",
        "health_system_capacity": "Limited ICU and critical care resources concentrated in Level 4-6."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Access Points show 'Level 4 - 6' (44 entries), 'Level 2 - 3' (11 entries), 'Level 2 - 6' (6 entries)",
          "Critical Illness Package entries = 4; Emergency, Chronic and Critical Illness Fund entries = 13"
        ],
        "policy_gaps": "No explicit emergency response time, 24/7 capability, triage or mandatory transfer timelines documented in dataset."
      },
      "recommended_resolution": {
        "immediate_action": "Issue national operational guidance mandating minimum emergency stabilization capabilities at Level 2–3 (basic airway, oxygen, IV fluids, basic resuscitation) and clear transfer protocols to Level 4–6 with target transfer time windows.",
        "policy_revision": "Define and codify facility-level emergency capabilities, 24/7 staffing expectations, ambulance/transfer pathways and targets (e.g., stabilization within 30 minutes, transfer initiated within 60 minutes where needed).",
        "implementation_steps": [
          "Map existing emergency capacity across 47 counties within 4 weeks.",
          "Designate and equip referral hubs (Level 4–6) and peripheral stabilization points (Level 2–3) with minimum required equipment and training.",
          "Fund ambulances/oxygen concentrators and telemedicine support through Emergency Fund coordination."
        ],
        "timeline": "Interim guidance within 2 weeks; structured rollout and resource mapping within 8–12 weeks."
      },
      "quality_metrics": {
        "detection_confidence": 0.92,
        "clinical_impact_score": 9.3,
        "urgency_level": "CRITICAL_IMMEDIATE_ACTION",
        "validation_method": "Cross-check of access point inconsistencies and lack of emergency time/transfer mandates in dataset"
      },
      "pdf_page_sources": [
        "Pages 1-18 (Policy Structure)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.320876",
      "run_number": 1,
      "unique_id": "CONTR_002"
    },
    {
      "contradiction_id": "MATERNAL_003_CRITICAL",
      "medical_specialty": "obstetrics",
      "contradiction_type": "maternal_emergency_capability_mismatch",
      "clinical_severity": "CRITICAL",
      "description": "Policy allows deliveries across varying facility levels but does not consistently guarantee emergency caesarean section capability, blood transfusion services, or 24/7 obstetric theatre availability where deliveries are permitted.",
      "medical_analysis": {
        "clinical_rationale": "Obstetric hemorrhage, obstructed labour, pre-eclampsia/eclampsia and sepsis are time-critical conditions where timely operative delivery, blood transfusion and critical care save lives.",
        "medical_standards": "WHO and international maternal care standards require that facilities offering childbirth either provide EmONC (Emergency Obstetric and Newborn Care) functions or have formal, fast transfer arrangements to sites that do.",
        "treatment_equivalence": "Allowing normal deliveries at a facility that cannot provide emergency CS or transfusion breaches EmONC standards unless formal mitigations exist.",
        "contraindication_assessment": "No safe clinical basis for permitting routine deliveries at a facility level that cannot ensure emergency operative care and transfusion for the catchment population."
      },
      "patient_safety_impact": {
        "immediate_risk": "Maternal and neonatal deaths from postpartum hemorrhage, obstructed labour, fetal distress due to delayed CS or lack of blood.",
        "clinical_consequences": "Increased maternal mortality and severe morbidity (e.g., hysterectomy, neurological damage in neonates).",
        "survival_impact": "Maternal mortality is highly sensitive to delays in operative delivery and availability of transfusion.",
        "quality_of_life": "Survivors may face chronic disability and economic hardship."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Counties risk designating facilities for deliveries without resourcing theatres, blood banks or skilled staff.",
        "geographic_access": "Rural women may present to nearest facility for labour; absence of EmONC leads to dangerous delays during transfers.",
        "resource_allocation": "Unplanned transfers strain ambulances and referral centres at Level 4–6.",
        "provider_training": "Midwives and general clinicians will face unclear thresholds for referral vs attempted management."
      },
      "epidemiological_context": {
        "disease_burden": "Pneumonia and CVD are leading causes but maternal mortality remains a critical indicator; obstetric emergencies remain significant cause of preventable mortality in Kenya.",
        "population_impact": "Rural maternal population disproportionately affected given 70% rural distribution.",
        "health_system_capacity": "Only a subset of Level 4–6 facilities have full EmONC; policy ambiguity increases risk."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Obs & Gyn annex procedures = 46; Access Points include Level 2-3 (some entries) and Level 4-6 (majority) but no clear EmONC mapping."
        ],
        "policy_gaps": "Lack of explicit requirement that facilities allowed to conduct deliveries must provide EmONC signal functions (including CS and blood transfusion) or have immediate transfer agreements."
      },
      "recommended_resolution": {
        "immediate_action": "Mandate that any facility sanctioned to provide deliveries must either: (a) provide full Basic or Comprehensive EmONC functions as appropriate to its level, or (b) have signed referral and transfer agreements with designated EmONC-capable centres, including guaranteed rapid transport.",
        "policy_revision": "Define EmONC requirements per facility level within SHIF documents and link reimbursement to compliance.",
        "implementation_steps": [
          "Audit all delivery sites within 8 weeks to classify EmONC capabilities.",
          "Upgrade selected Level 3 facilities that serve large rural populations to provide Basic EmONC (oxytocics, assisted delivery, manual placenta removal, IV antibiotics, anticonvulsants) and ensure Level 4–6 provide Comprehensive EmONC including CS and blood transfusion.",
          "Train midwives and clinicians on recognition and rapid referral pathways."
        ],
        "timeline": "Immediate interim directive; facility audit and phased upgrades over 3–6 months."
      },
      "quality_metrics": {
        "detection_confidence": 0.93,
        "clinical_impact_score": 9.4,
        "urgency_level": "CRITICAL_IMMEDIATE_ACTION",
        "validation_method": "Policy access point inconsistencies and recommended EmONC standards"
      },
      "pdf_page_sources": [
        "Pages 1-18 (Policy Structure)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.322316",
      "run_number": 1,
      "unique_id": "CONTR_003"
    },
    {
      "contradiction_id": "PED_004_HIGH",
      "medical_specialty": "paediatrics",
      "contradiction_type": "paediatric_service_availability_and_protocol_gap",
      "clinical_severity": "HIGH",
      "description": "Paediatric-specific services and protocols are under-represented (only 12 paediatric procedures) while adult-focused packages predominate; policies do not explicitly require age-appropriate equipment, dosing or neonatal/pediatric critical care capacity at designated levels.",
      "medical_analysis": {
        "clinical_rationale": "Children (including neonates) require weight-based drug dosing, appropriately sized airway equipment, pediatric ventilators, paediatric fluid resuscitation protocols and child-specific monitoring. Adults' protocols cannot be safely extrapolated.",
        "medical_standards": "Pediatric emergency care standards and WHO paediatric guidelines require age-appropriate equipment, staff skilled in paediatric resuscitation, and defined referral pathways to neonatal/pediatric ICU where needed.",
        "treatment_equivalence": "Applying adult protocols to children increases risk of dosing errors, airway/device mismatch and poor outcomes.",
        "contraindication_assessment": "Lack of paediatric specification is not clinically acceptable given differing physiology and safety needs."
      },
      "patient_safety_impact": {
        "immediate_risk": "Medication dosing errors, inappropriate device sizing, suboptimal resuscitation leading to avoidable mortality or morbidity.",
        "clinical_consequences": "Increased pediatric admissions, higher complication rates, long-term disability from suboptimal initial management.",
        "survival_impact": "Pediatric and neonatal survival dependent on early correct management; gaps will worsen outcomes.",
        "quality_of_life": "Increased chronic disability and caregiver burden."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Level 2–4 facilities that serve many children may be under-equipped or lack protocols; Level 4–6 shortage of paediatric ICU capacity may create referral bottlenecks.",
        "geographic_access": "Rural children disproportionately affected by distance to paediatric-capable centres.",
        "resource_allocation": "Need to prioritize child-sized equipment and paediatric training in county budgets.",
        "provider_training": "Urgent need for paediatric resuscitation and dosing education across clinicians and pharmacists."
      },
      "epidemiological_context": {
        "disease_burden": "Pneumonia is leading registered cause of death—children heavily affected—yet pediatric procedures/policies are limited in dataset.",
        "population_impact": "Large fraction of child morbidity/mortality concentrated in rural areas.",
        "health_system_capacity": "Limited pediatric ICU beds and trained staff in many counties."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Paediatric annex procedures = 12 out of 728; Paediatric specialty coverage low relative to others."
        ],
        "policy_gaps": "No dataset evidence of required paediatric-specific capabilities, weight-based dosing protocols, or neonatal ICU designations."
      },
      "recommended_resolution": {
        "immediate_action": "Issue guidance requiring all facilities seeing paediatric patients to maintain minimum paediatric emergency equipment list and weight-based dosing charts; ensure triage protocols separate children and mandate paediatric-trained staff on-call.",
        "policy_revision": "Incorporate specific paediatric packages into SHIF (including neonatal care, pediatric resuscitation, pneumonia treatment packages) and designate referral pathways to pediatric/neonatal ICUs.",
        "implementation_steps": [
          "Procure and distribute basic paediatric equipment (bag-valve-masks in neonatal/child sizes, paediatric monitors, appropriate ET tubes) to Level 2–4 facilities serving high child volumes within 12 weeks.",
          "Implement training (ETAT—Emergency Triage Assessment and Treatment) for clinicians across counties.",
          "Map paediatric ICU capacity at Level 4–6 and create transfer protocols."
        ],
        "timeline": "Interim equipment and training guidance within 4 weeks; phased implementation over 3–6 months."
      },
      "quality_metrics": {
        "detection_confidence": 0.89,
        "clinical_impact_score": 8.6,
        "urgency_level": "HIGH",
        "validation_method": "Specialty counts and absence of paediatric-specific policy elements in dataset"
      },
      "pdf_page_sources": [
        "Pages 1-18 (Policy Structure)",
        "Pages 19-54 (Annex Procedures)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.323794",
      "run_number": 1,
      "unique_id": "CONTR_004"
    },
    {
      "contradiction_id": "FACILITY_005_HIGH",
      "medical_specialty": "neurosurgery / cardiothoracic / vascular",
      "contradiction_type": "facility_capability_mismatch_for_high_complexity_procedures",
      "clinical_severity": "HIGH",
      "description": "Annex lists significant numbers of highly complex surgical procedures (Neurosurgery 29, Cardiothoracic & Vascular 92, Urological 146) while access mapping is inconsistent and some service descriptions imply availability at lower-tier facilities lacking requisite theatres, ICU, imaging and specialist teams.",
      "medical_analysis": {
        "clinical_rationale": "High-complexity surgeries require appropriate infrastructure: imaging (CT/MRI), perioperative critical care, blood bank, specialist surgical and anesthetic teams, and postoperative ICU/HDU. Performing them in under-equipped sites is unsafe.",
        "medical_standards": "Surgical safety checklists, WHO Safe Surgery and specialty-specific facility standards require defined capabilities before offering complex procedures.",
        "treatment_equivalence": "Not all facilities with basic operating theatres are equivalent in capacity to deliver cardiothoracic or neurosurgical care.",
        "contraindication_assessment": "Issuing coverage for complex operations at lower-level facilities without minimum capability is clinically unjustifiable."
      },
      "patient_safety_impact": {
        "immediate_risk": "Intraoperative complications, inadequate postoperative monitoring, lack of blood or ventilator support, leading to preventable morbidity and mortality.",
        "clinical_consequences": "Higher rates of surgical complications, ICU admissions, reoperations and deaths.",
        "survival_impact": "Complex surgery outcomes closely linked to facility volume and capability; policy-driven decentralization without support worsens outcomes.",
        "quality_of_life": "Increased disability from inadequately managed complications."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Confusion over permissible procedures at Level 3–4 could lead to unsafe practice or patient diversion to distant Level 6 centres.",
        "geographic_access": "Patients in rural counties may be offered complex surgery locally despite lack of capacity due to policy ambiguity.",
        "resource_allocation": "Misplaced investments in unsupported surgical activity rather than strengthening referral hubs and transport.",
        "provider_training": "Surgeons and anaesthetists may be pressured to perform beyond local safe scope."
      },
      "epidemiological_context": {
        "disease_burden": "Non-communicable diseases including CVD and surgical conditions are rising; appropriate centralization with referral pathways is essential.",
        "population_impact": "Rural populations at risk of receiving substandard surgical care.",
        "health_system_capacity": "Limited neurosurgical and cardiothoracic specialists concentrated in a few centres."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Annex procedures include Neurosurgery = 29, Cardiothoracic & Vascular = 92, Urological = 146; Access Points show mixed levels including Level 3 and Level 2-6 entries."
        ],
        "policy_gaps": "No clear mapping of minimum facility requirements for each high-complexity procedure and thresholds for referral vs local provision."
      },
      "recommended_resolution": {
        "immediate_action": "Temporarily restrict SHIF coverage for high-complexity procedures to facilities meeting verified capability criteria (imaging, blood bank, ICU, specialist teams) until facility accreditation occurs.",
        "policy_revision": "Define facility accreditation standards for complex surgical procedures (per specialty), centralize complex services to designated Level 4–6 referral hubs and establish clear, funded transfer pathways.",
        "implementation_steps": [
          "Create a national surgical facility accreditation checklist and perform rapid accreditation within 8–12 weeks.",
          "Fund and prioritize strengthening of designated referral centres and transportation/logistics.",
          "Communicate accredited lists to counties and providers; link reimbursement to accreditation."
        ],
        "timeline": "Immediate interim restriction; accreditation and referral mapping within 3 months."
      },
      "quality_metrics": {
        "detection_confidence": 0.91,
        "clinical_impact_score": 8.9,
        "urgency_level": "HIGH",
        "validation_method": "Cross-analysis of annex procedure volumes vs access point mapping without facility capability definitions"
      },
      "pdf_page_sources": [
        "Pages 1-18 (Policy Structure)",
        "Pages 19-54 (Annex Procedures)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.325841",
      "run_number": 1,
      "unique_id": "CONTR_005"
    },
    {
      "contradiction_id": "FUND_006_MODERATE",
      "medical_specialty": "health_systems / financing",
      "contradiction_type": "funding_mapping_and_tariff_absence_causing_authorization_confusion",
      "clinical_severity": "MODERATE",
      "description": "Only 3 entries have Fund info (out of 97 services) and Tariffs are absent (0 entries), while annex procedures list 728 procedures with varied tariff ranges. This creates severe authorization and payment ambiguity that can delay care, lead to catastrophic out-of-pocket payments, and confuse providers about pre-authorisation vs emergency payments.",
      "medical_analysis": {
        "clinical_rationale": "Clear mapping of services to funding source, defined tariffs and payment pathways (including emergency carve-outs) is necessary to prevent delays in authorization of time-sensitive care.",
        "medical_standards": "Health financing best practice requires transparent benefit package, defined tariffs or case rates and emergency authorization exceptions to prioritize patient care.",
        "treatment_equivalence": "Same clinical service must have consistent reimbursement and authorization pathway; discrepancies lead to unequal care.",
        "contraindication_assessment": "Absence of tariff and fund mapping is an administrative gap with direct clinical implications for access."
      },
      "patient_safety_impact": {
        "immediate_risk": "Delays awaiting pre-authorization or refusal to treat uninsured procedures in emergencies; financial barriers to accessing time-critical interventions.",
        "clinical_consequences": "Progression of disease, avoidable complications, increased referrals or patient default.",
        "survival_impact": "In emergencies, administrative delays contribute to increased mortality risk.",
        "quality_of_life": "Financial hardship and reduced access to timely interventions."
      },
      "kenya_health_system_impact": {
        "facility_level_effects": "Providers uncertain about reimbursement may postpone care or require upfront payment; smaller facilities are vulnerable.",
        "geographic_access": "Rural patients more likely to be charged out-of-pocket if county facilities lack funds mapping.",
        "resource_allocation": "Inefficient use of limited public funds and risk of provider non-participation in SHIF.",
        "provider_training": "Front-line staff need clear authorization and billing procedures to avoid delaying care."
      },
      "epidemiological_context": {
        "disease_burden": "High burden of chronic and acute conditions (CVD, CKD, pneumonia, cancer) where timely treatment prevents progression; unclear funding undermines access.",
        "population_impact": "Vulnerable groups (poor, rural) will bear disproportionate financial and access burden.",
        "health_system_capacity": "SHIF intended to pool risk; lack of operational clarity undermines policy effectiveness."
      },
      "evidence_documentation": {
        "policy_data_references": [
          "Extracted SHIF: Policy Structure Data shows Entries with Fund info = 3, Entries with Service info = 6, Entries with Tariffs = 0; Annex Tariff Range exists (KES 2,240 - 2,186,800, Average KES 187,976).",
          "Top Funds mapping inconsistent: 'SOCIAL HEALTH INSUR ANCE FUND' (60), 'PRIMARY HEALTH CARE FUND' (24), 'EMERG ENCY, CHRONIC AND CRIT ICAL ILLNESS FUND' (13) but most services not mapped."
        ],
        "policy_gaps": "No consistent tariff schedule or fund-service mapping in dataset; no explicit emergency pre-authorisation rules captured."
      },
      "recommended_resolution": {
        "immediate_action": "Declare emergency services to be exempt from pre-authorization and billable against Emergency/ Critical Illness Fund pending routine claims — communicate to all providers.",
        "policy_revision": "Publish a clear mapping of services to funding sources, a provisional tariff schedule (or case rates) for all annex procedures, and explicit emergency payment rules.",
        "implementation_steps": [
          "Produce and disseminate an interim tariff/authorization matrix within 2 weeks, prioritized for life-saving procedures.",
          "Establish a fast-track claims mechanism for emergency services and an audit mechanism to prevent abuse.",
          "Complete full tariff-setting consultation with clinical and actuarial teams within 8–12 weeks."
        ],
        "timeline": "Interim funding guidance within 2 weeks; full tariff mapping and policy within 3 months."
      },
      "quality_metrics": {
        "detection_confidence": 0.94,
        "clinical_impact_score": 8.0,
        "urgency_level": "MODERATE_HIGH",
        "validation_method": "Dataset fund/tariff counts cross-referenced with annex tariff entries and funds distribution"
      },
      "pdf_page_sources": [
        "Pages 19-54 (Annex Procedures)"
      ],
      "validation_ready": true,
      "discovered_at": "2025-08-27T19:36:58.328278",
      "run_number": 1,
      "unique_id": "CONTR_006"
    }
  ],
  "total_runs": 1,
  "last_updated": "2025-08-27T19:36:58.328301",
  "total_unique_gaps": 0,
  "total_unique_contradictions": 6,
  "current_run_gaps": 0,
  "current_run_contradictions": 6
}